# Average values
# Средние значения


from math import *
a = float(input())   #среднее арифметическое, геометрическое, гармоническое и квадратичное.
b = float(input())
c = (a+b)/2 # среднее арифметическое
d = sqrt(a*b) #среднее геометрическое
g = (2*a*b)/(a+b)  #среднее гармоническое
k = sqrt((a**2+b**2)/2)  #среднее квадратическое чисел
print(c)
print(d)
print(g)
print(k)


Sample Input 1:
1.0
2.0
Sample Output 1:
1.5
1.4142135623730951
1.3333333333333333
1.5811388300841898
Sample Input 2:
35.1
40.3
Sample Output 2:
37.7
37.61023796787252
37.52068965517241
37.78954881974644
Sample Input 3:
50.0
25.5
Sample Output 3:
37.75
35.70714214271425
33.77483443708609
39.687844486693905
