# Dividers 1
Напишите функцию get_factors(num), принимающую в качестве аргумента натуральное число и возвращающую список всех делителей данного числа.
Примечание. Следующий программный код:
# Write a function get_factors(num) that takes a natural number as an argument and returns a list of all factors of that number.
# Note. The following program code:
print(get_factors(1))
print(get_factors(5))
print(get_factors(10))

должен выводить:
# should output:
[1]
[1, 5]
[1, 2, 5, 10]


# объявление функции
def get_factors(num):
    a = []
    for i in range(1, num+1):
        if num % i == 0:
            a.append(i)
    return a
# считываем данные
n = int(input())
# вызываем функцию
print(get_factors(n))  
  
  
Номер теста	Входные данные	Выходные данные
1	            1	              [1]
2	            5	              [1, 5]
3	            10	            [1, 2, 5, 10]
4	            36	            [1, 2, 3, 4, 6, 9, 12, 18, 36]
5	            360	            [1, 2, 3, 4, 5, 6, 8, 9, 10, 12, 15, 18, 20, 24, 30, 36, 40, 45, 60, 72, 90, 120, 180, 360]
6	            10800	          [1, 2, 3, 4, 5, 6, 8, 9, 10, 12, 15, 16, 18, 20, 24, 25, 27, 30, 36, 40, 45, 48, 50, 54, 60, 72, 75, 80, 90, 100, 108, 120, 135, 144, 150, 180, 200, 216, 225, 240, 270, 300, 360, 400, 432, 450, 540, 600, 675, 720, 900, 1080, 1200, 1350, 1800, 2160, 2700, 3600, 5400, 10800]
7	            101	            [1, 101]
