# Звездный прямоугольник

# Напишите программу, которая выводит прямоугольник, по периметру состоящий из звездочек (*).

# Star rectangle

# Write a program that prints a rectangle with asterisks (*) around its perimeter.

print(
"""
*****************
*               *
*               *
*****************
""")

# Sample Input:
# Sample Output:
# *****************
# *               *
# *               *
# *****************
