# Repeat after me 1
# Повторяй за мной 1
# Дано предложение и количество раз которое его надо повторить. Напишите программу, которая повторяет данное предложение нужное количество раз.
# A sentence is given and the number of times it must be repeated. Write a program that repeats this sentence the required number of times.


a = input()
b = int(input())
for i in range (b):
    print(a)
  

Sample Input 1:
Век живи - век учись.
10
Sample Output 1:
Век живи - век учись.
Век живи - век учись.
Век живи - век учись.
Век живи - век учись.
Век живи - век учись.
Век живи - век учись.
Век живи - век учись.
Век живи - век учись.
Век живи - век учись.
Век живи - век учись.
Sample Input 2:
Время - деньги!
5
Sample Output 2:
Время - деньги!
Время - деньги!
Время - деньги!
Время - деньги!
Время - деньги!
Sample Input 3:
Учение - путь к умению.
21
Sample Output 3:
Учение - путь к умению.
Учение - путь к умению.
Учение - путь к умению.
Учение - путь к умению.
Учение - путь к умению.
Учение - путь к умению.
Учение - путь к умению.
Учение - путь к умению.
Учение - путь к умению.
Учение - путь к умению.
Учение - путь к умению.
Учение - путь к умению.
Учение - путь к умению.
Учение - путь к умению.
Учение - путь к умению.
Учение - путь к умению.
Учение - путь к умению.
Учение - путь к умению.
Учение - путь к умению.
Учение - путь к умению.
Учение - путь к умению.
