# Even or odd?
# Write a program that determines whether a number is even or odd.

# Четное или нечетное?
# Напишите программу, которая определяет, является число четным или нечетным.

a = int(input())
if a % 2 == 0:
    print('Четное')
else:
    print('Нечетное')
  
# Sample Input 1:
# 10
# Sample Output 1:
# Четное
# Sample Input 2:
# 17
# Sample Output 2:
# Нечетное
# Sample Input 3:
# 0
# Sample Output 3:
# Четное
