# Напишите программу, которая считает стоимость трех компьютеров, состоящих из монитора, системного блока, клавиатуры и мыши.
# Write a program that calculates the cost of three computers, consisting of a monitor, a system unit, a keyboard and a mouse.

# Sample Input 3:
# 44990
# 123300
# 19600
# 8990
# Sample Output 3:
# 590640 

a = int(input())
b = int(input())
c = int(input())
d = int(input())
e = (a + b + c + d)*3
print (e)
