ФИО
# Full name
На вход программе подаются три строки: имя, фамилия и отчество (именно в таком порядке). Напишите программу, которая выводит инициалы человека.
# The program receives three lines as input: first name, last name and patronymic (in that order). Write a program that prints a person's initials.

i = input() #Программа должна вывести ФИО человека.
f = input()
o = input()
print(f[0]+i[0]+o[0])


Sample Input:
Тимур
Гуев
Ахсарбекович
Sample Output:
ГТА
