# Determine what problem the following code fragment solves:
Определите какую задачу решает следующий фрагмент кода:

n = int(input())
i = 2
while n % i != 0:
    i += 1
print(i)

# выводит минимальный делитель числа, отличный от единицы
