# Determine what problem the following code fragment solves:
Определите какую задачу решает следующий фрагмент кода:

n = int(input())
res = 1
i = 2
while i <= n:
    res *= i
    i += 1
print(res)

# выводит факториал числа n
