# Ramanujan numbers 🌶️
# Srinivasa Ramanujan was an Indian mathematician renowned for his intuition in the field of numbers. When the English mathematician Godfrey Hardy visited him one day in hospital,
# he mentioned that the number of the taxi he arrived in was 1729, such a boring and ordinary number. To which Ramanujan replied: “No, no!
# This is a very interesting number. It is the smallest number that can be expressed as the sum of two cubes in two different ways." In other words: 1729 =1**3+12**3=9**3+10**3.
# Write a program that finds similar interesting numbers. In your answer, write down the first 5 numbers in ascending order, including the number 1729.
# Note. Use a nested loop.
Числа Рамануджана 🌶️
Сриниваса Рамануджан – индийский математик, славившийся своей интуицией в области чисел. Когда английский математик Годфри Харди навестил его однажды в больнице, 
он обмолвился, что номером такси, на котором он приехал, было 1729, такое скучное и заурядное число. На что Рамануджан ответил: "Нет, нет! 
Это очень интересное число. Это наименьшее число, выражаемое как сумма двух кубов двумя разными способами". Другими словами: 1729 =1**3+12**3=9**3+10**3.
Напишите программу, которая находит аналогичные интересные числа. В ответе запишите первые 5 чисел в порядке возрастания, включая число 1729.
Примечание. Используйте вложенный цикл.

1 число =  1729
2 число =  4104
3 число =  13832
4 число =  20683
5 число = 32832
