# Напишите программу, которая выводит на экран текст «I***like***Python» (без кавычек).
# Write a program that displays text on the screen
# Примечание. Используйте необязательный параметр sep.
# Note. Use the optional sep parameter.

print('I', 'like', 'Python', sep='***') # I***like***Python
