# Напишите программу, которая приветствует пользователя, выводя слово «Привет» (без кавычек), после которого должна стоять запятая и пробел, а затем введенное имя и восклицательный знак.
name1 = input()
print ('Привет,',name1, end ='!') # Привет, Джон!
