# Напишите программу, которая находит полное число метров по заданному числу сантиметров.
# Write a program that finds the total number of meters given the number of centimeters.

sm = int(input())
m = sm // 100
print(m)

# Sample Input 1:
# 345
# Sample Output 1:
# 3
