# Accessory 2
# Принадлежность 2
# Write a program that accepts an integer x and determines whether it does not belong to the range from -3 to 7.
# Напишите программу, которая принимает целое число x и определяет, не принадлежит промежутку от -3 до 7.

x = int(input())
if - 3 < x < 7:
    print('Не принадлежит')
else:
    print('Принадлежит')

# Sample Input 1:
# -44
# Sample Output 1:
# Принадлежит
# Sample Input 2:
# -3
# Sample Output 2:
# Принадлежит
# Sample Input 3:
# 5
# Sample Output 3:
# Не принадлежит
